zhanglazhuan/NomadCast/debug/t_wakeup/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# USB Serial/JTAG console. It disconnects while the cable is unplugged and
# reconnects after a successful USB-triggered wakeup.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# NomadCast V1 has 16 MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Keep common ESP-IDF defaults compatible with the other debug projects.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_TIMEOUT_MS=10000
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FATFS_USE_LABEL=y
